{
  "make": {
    "Unknown": 0,
    "Other": 1,
    "BMW": 2,
    "Porsche": 3,
    "Mercedes-Benz": 4,
    "Audi": 5,
    "Alfa Romeo": 6,
    "Suzuki": 7,
    "Volvo": 8,
    "Honda": 9,
    "Hyundai": 10,
    "Aston Martin": 11,
    "Volkswagen": 12,
    "BYD": 13,
    "Ford": 14,
    "Maserati": 15,
    "Rolls-Royce": 16,
    "smart": 17,
    "SsangYong": 18,
    "Maybach": 19,
    "Mitsubishi": 20,
    "Opel": 21,
    "Renault": 22,
    "Dongfeng": 23,
    "Tesla": 24,
    "Bugatti": 25,
    "Kia": 26
  },
  "model": {
    "Unknown": 0,
    "Other": 1,
    "Cayenne": 2,
    "Macan": 3,
    "992": 4,
    "X5": 5,
    "X1": 6,
    "X3": 7,
    "911": 8,
    "320": 9,
    "Panamera": 10,
    "A6": 11,
    "Q5": 12,
    "Stelvio": 13,
    "Tonale": 14,
    "118": 15,
    "520": 16,
    "530": 17,
    "Taycan": 18,
    "Q3": 19,
    "318": 20,
    "Boxster": 21,
    "991": 22,
    "116": 23,
    "330": 24,
    "Swift": 25,
    "A5": 26,
    "218": 27,
    "X2": 28,
    "Vitara": 29,
    "Q8": 30,
    "Junior": 31,
    "X4": 32,
    "Cayman": 33,
    "997": 34,
    "A4": 35,
    "Giulia": 36,
    "420": 37,
    "A3": 38,
    "GLC 300": 39,
    "Giulietta": 40,
    "X6": 41,
    "GLA 200": 42,
    "M4": 43,
    "A 200": 44,
    "A 180": 45,
    "Q7": 46,
    "GLC 220": 47,
    "CLA 250": 48,
    "CLA 200": 49,
    "120": 50,
    "XC60": 51,
    "E 300": 52,
    "V 300": 53,
    "996": 54,
    "GLB 200": 55,
    "GLC 200": 56,
    "RS3": 57,
    "718": 58,
    "GLE 450": 59,
    "XC40": 60,
    "CLA 180": 61,
    "Vito": 62,
    "220": 63,
    "V60": 64,
    "M2": 65,
    "Q2": 66,
    "C 300": 67,
    "M5": 68,
    "MiTo": 69,
    "V40": 70,
    "Ignis": 71,
    "540": 72,
    "S-Cross": 73,
    "Z4": 74,
    "RS6": 75,
    "X5 M": 76,
    "M3": 77,
    "A 250": 78,
    "XC90": 79,
    "GLE 350": 80,
    "C 200": 81,
    "216": 82,
    "430": 83,
    "e-tron": 84,
    "440": 85,
    "A6 e-tron": 86,
    "Jimny": 87,
    "316": 88,
    "Q6 e-tron": 89,
    "C 180": 90,
    "GLA 180": 91,
    "GLE 53 AMG": 92,
    "E 220": 93,
    "Citan": 94,
    "730": 95,
    "X3 M": 96,
    "640": 97,
    "EQB 250": 98,
    "E 200": 99,
    "G 63 AMG": 100,
    "X6 M": 101,
    "Civic": 102,
    "SX4 S-Cross": 103,
    "SQ5": 104,
    "340": 105,
    "Sprinter": 106,
    "S6": 107,
    "CR-V": 108,
    "X4 M": 109,
    "A1": 110,
    "X7": 111,
    "C 220": 112,
    "V70": 113,
    "i3": 114,
    "740": 115,
    "840": 116,
    "435": 117,
    "RS Q8": 118,
    "B 200": 119,
    "525": 120,
    "Jazz": 121,
    "718 Spyder": 122,
    "E 53 AMG": 123,
    "159": 124,
    "AMG GT": 125,
    "GLE 400": 126,
    "GLA 250": 127,
    "135": 128,
    "EQA 250": 129,
    "V50": 130,
    "V 250": 131,
    "CLE 200": 132,
    "750": 133,
    "B 180": 134,
    "147": 135,
    "S60": 136,
    "i4": 137,
    "Grand Vitara": 138,
    "225": 139,
    "M850": 140,
    "550": 141,
    "A7": 142,
    "E 450": 143,
    "Alto": 144,
    "S5": 145,
    "A8": 146,
    "iX": 147,
    "325": 148,
    "140": 149,
    "i8": 150,
    "M8": 151,
    "GLS 450": 152,
    "745": 153,
    "235": 154,
    "CLA 220": 155,
    "GLC 400": 156,
    "i10": 157,
    "GLB 180": 158,
    "418": 159,
    "V90": 160,
    "B 250": 161,
    "iX3": 162,
    "Vantage": 163,
    "iX35": 164,
    "S 450": 165,
    "RS Q3": 166,
    "S3": 167,
    "428": 168,
    "630": 169,
    "forTwo": 170,
    "SX4": 171,
    "Swace": 172,
    "A6 allroad": 173,
    "GLA 220": 174,
    "535": 175,
    "CLE 220": 176,
    "GLB 220": 177,
    "SQ8": 178,
    "M550": 179,
    "HR-V": 180,
    "XM": 181,
    "i20": 182,
    "GLC 450": 183,
    "CLE 53 AMG": 184,
    "S 580": 185,
    "Seal U": 186,
    "Q4 e-tron": 187,
    "A4 allroad": 188,
    "SQ7": 189,
    "CLE 300": 190,
    "G 580": 191,
    "S40": 192,
    "Golf": 193,
    "M6": 194,
    "240": 195,
    "Z3": 196,
    "C30": 197,
    "156": 198,
    "T-Class": 199,
    "V40 Cross Country": 200,
    "G 450": 201,
    "IONIQ 9": 202,
    "125": 203,
    "EQE 300": 204,
    "G 500": 205,
    "Targa": 206,
    "EQE SUV": 207,
    "i30": 208,
    "RS4": 209,
    "S80": 210,
    "GLE 63 AMG": 211,
    "XC70": 212,
    "Tivoli": 213,
    "760": 214,
    "Levante": 215,
    "EQS": 216,
    "335": 217,
    "GLC 63 AMG": 218,
    "545": 219,
    "EQV 300": 220,
    "e-tron GT": 221,
    "Across": 222,
    "Baleno": 223,
    "GLE 300": 224,
    "518": 225,
    "SL 63 AMG": 226,
    "i7": 227,
    "Seal": 228,
    "V60 Cross Country": 229,
    "Q8 e-tron": 230,
    "TT": 231,
    "i5": 232,
    "Splash": 233,
    "C 63 AMG": 234,
    "Ghibli": 235,
    "Focus": 236,
    "RS5": 237,
    "S90": 238,
    "Wagon R+": 239,
    "GT": 240,
    "S 63 AMG": 241,
    "Celerio": 242,
    "Z4 M": 243,
    "A 220": 244,
    "iX20": 245,
    "A 35 AMG": 246,
    "Polo": 247,
    "V 220": 248,
    "Accord": 249,
    "forFour": 250,
    "Brera": 251,
    "X7 M": 252,
    "S 350": 253,
    "DBX": 254,
    "S4": 255,
    "114": 256,
    "SQ6 e-tron": 257,
    "X2 M": 258,
    "C70": 259,
    "523": 260,
    "650": 261,
    "EQE 350": 262,
    "DB9": 263,
    "V8": 264,
    "Fiesta": 265,
    "V90 Cross Country": 266,
    "EQS SUV": 267,
    "SANTA FE": 268,
    "Dolphin": 269,
    "328": 270,
    "Cullinan": 271,
    "SL 43 AMG": 272,
    "Spider": 273,
    "RS7": 274,
    "Grecale": 275,
    "GLS 63 AMG": 276,
    "Ghost": 277,
    "GLC 43 AMG": 278,
    "Box": 279,
    "Sealion 7": 280,
    "Tiguan": 281,
    "Atto 3": 282,
    "Insight": 283,
    "128": 284,
    "230": 285,
    "S8": 286,
    "Vanquish": 287,
    "528": 288,
    "CLE 180": 289,
    "V": 290,
    "i40": 291,
    "GranTurismo": 292,
    "166": 293,
    "Marco Polo": 294,
    "R8": 295,
    "57": 296,
    "iX1": 297,
    "Korando": 298,
    "425": 299,
    "Rexton": 300,
    "S 500": 301,
    "Atto 2": 302,
    "GLB 250": 303,
    "CLE 450": 304,
    "DBS": 305,
    "SL 55 AMG": 306,
    "228": 307,
    "S7": 308,
    "620": 309,
    "DB12": 310,
    "Quattroporte": 311,
    "Model 3": 312,
    "EQA": 313,
    "EQB 300": 314,
    "DB11": 315,
    "Kuga": 316,
    "Silver Shadow": 317,
    "GLE 580": 318,
    "GLS 350": 319,
    "G 400": 320,
    "Wraith": 321,
    "Phantom": 322,
    "Eclipse Cross": 323,
    "CR-Z": 324,
    "C 43 AMG": 325,
    "B 220": 326,
    "EQE 53": 327,
    "#1": 328,
    "EQT": 329,
    "Mondeo": 330,
    "Chiron": 331,
    "Spectre": 332,
    "223": 333,
    "G": 334,
    "CLA 45 AMG": 335,
    "GLC 250": 336,
    "4C": 337,
    "T-Cross": 338,
    "Space Star": 339,
    "Touran": 340,
    "Tang": 341,
    "850": 342,
    "RS e-tron GT": 343,
    "Rapide": 344,
    "CLA 350": 345,
    "DB7": 346,
    "Puma": 347,
    "TTS": 348,
    "EcoSport": 349,
    "Torres": 350,
    "Corsa": 351,
    "Liana": 352,
    "Astra": 353,
    "Corniche": 354,
    "CLA 35 AMG": 355,
    "323": 356,
    "GLS 580": 357,
    "A 45 AMG": 358,
    "C-Max": 359,
    "MC20": 360,
    "Active Hybrid 3": 361,
    "S-Max": 362,
    "S6 e-tron": 363,
    "GLS 600": 364,
    "Passat": 365,
    "GLA 35 AMG": 366,
    "GTV": 367,
    "130": 368,
    "Clio": 369,
    "EQA 300": 370,
    "Outlander": 371,
    "Megane": 372,
    "Ka/Ka+": 373,
    "123": 374,
    "735": 375,
    "Musso": 376,
    "ASX": 377,
    "GLA 45 AMG": 378,
    "Carrera GT": 379,
    "Dawn": 380,
    "IONIQ": 381,
    "T-Roc": 382,
    "Caddy": 383,
    "Dolphin Surf": 384,
    "GLB 35 AMG": 385,
    "S 600": 386,
    "Sportage": 387,
    "GLS 400": 388,
    "Tourneo Connect": 389,
    "S60 Cross Country": 390,
    "iX2": 391,
    "Sharan": 392,
    "SQ2": 393,
    "EQB 350": 394,
    "E 400": 395,
    "Passat Variant": 396,
    "Galaxy": 397,
    "725": 398,
    "Cloud": 399,
    "Active Hybrid 5": 400,
    "Captur": 401,
    "Virage": 402,
    "Colt": 403,
    "H-1": 404,
    "up!": 405,
    "Edge": 406,
    "RS": 407,
    "S 680": 408,
    "Z8": 409,
    "Sportwagon": 410,
    "Arteon": 411,
    "Silver Spur": 412,
    "E 63 AMG": 413,
    "Twingo": 414,
    "918": 415,
    "1er M Coupé": 416,
    "Grand Santa Fe": 417,
    "145": 418,
    "Golf Variant": 419,
    "EQE 43": 420,
    "450": 421,
    "Coupe": 422,
    "Transit Courier": 423,
    "Mokka": 424,
    "Mustang": 425,
    "Transit Custom": 426,
    "CL": 427,
    "M1": 428,
    "62": 429,
    "Golf Plus": 430,
    "TT RS": 431,
    "Tiguan Allspace": 432,
    "Valkyrie": 433,
    "Quadrifoglio": 434,
    "Cygnet": 435,
    "944": 436,
    "Model S": 437,
    "EQE 500": 438,
    "#3": 439,
    "Phantom Drophead": 440,
    "Golf GTI": 441,
    "CL 220": 442,
    "Kizashi": 443,
    "Pajero": 444,
    "Ranger": 445,
    "Kyron": 446,
    "B-Max": 447,
    "8C": 448,
    "214": 449,
    "DB": 450,
    "Tourneo Courier": 451,
    "146": 452,
    "50": 453,
    "Taigo": 454,
    "645": 455,
    "100": 456,
    "GranCabrio": 457,
    "Ceed / cee'd": 458,
    "EQA 350": 459,
    "EX40": 460,
    "Transit": 461,
    "brabus": 462,
    "Model Y": 463,
    "SL 680": 464,
    "AMG ONE": 465,
    "Samurai": 466,
    "FR-V": 467,
    "3200": 468,
    "Antara": 469,
    "T5 Multivan": 470,
    "180": 471,
    "Focus C-Max": 472,
    "C 30 AMG": 473,
    "Santana": 474,
    "Frontera": 475,
    "728": 476,
    "356": 477,
    "T6 Transporter": 478,
    "Maybach S-Klasse": 479,
    "VELOSTER": 480,
    "Model X": 481,
    "EV6": 482,
    "C 400": 483,
    "635": 484,
    "Koleos": 485,
    "Crosswagon": 486,
    "Silver Spirit": 487,
    "Meriva": 488,
    "300": 489,
    "Z3 M": 490,
    "QUATTRO": 491,
    "Biturbo": 492,
    "930": 493,
    "T5 Caravelle": 494,
    "Zafira": 495,
    "Insignia": 496,
    "Golf Cabriolet": 497,
    "Golf GTE": 498,
    "Crossland X": 499,
    "CL 200": 500,
    "Veyron": 501,
    "Golf R": 502,
    "Arkana": 503,
    "SL Roadster AMG": 504,
    "Touareg": 505,
    "Grand C-Max": 506,
    "Fusion": 507,
    "Rodius": 508
  },
  "body_type": {
    "Unknown": 0,
    "Other": 1,
    "Off-Road/Pick-up": 2,
    "Sedan": 3,
    "Station wagon": 4,
    "Coupe": 5,
    "Convertible": 6,
    "Compact": 7,
    "Van": 8,
    "Transporter": 9,
    "Panel van": 10,
    "Station wagon/van": 11,
    "Box": 12,
    "Van-high roof": 13,
    "Flatbed van": 14,
    "Flatbed+tarpaulin": 15
  },
  "fuel_category": {
    "Unknown": 0,
    "Other": 1,
    "Gasoline": 2,
    "Diesel": 3,
    "Electric/Gasoline": 4,
    "Electric": 5,
    "Electric/Diesel": 6,
    "Others": 7,
    "LPG": 8,
    "CNG": 9,
    "Ethanol": 10
  },
  "transmission": {
    "Unknown": 0,
    "Other": 1,
    "Automatic": 2,
    "Manual": 3,
    "Semi-automatic": 4
  },
  "country_code": {
    "Unknown": 0,
    "Other": 1,
    "DE": 2,
    "IT": 3,
    "NL": 4,
    "BE": 5,
    "ES": 6,
    "AT": 7,
    "FR": 8,
    "LU": 9
  },
  "seller_type": {
    "Unknown": 0,
    "Other": 1,
    "Dealer": 2,
    "PrivateSeller": 3
  },
  "offer_type": {
    "Unknown": 0,
    "Other": 1,
    "U": 2,
    "N": 3,
    "A": 4
  },
  "vehicle_type": {
    "Unknown": 0,
    "Other": 1,
    "Car": 2,
    "Transporter": 3
  },
  "listing_status": {
    "Unknown": 0,
    "Other": 1,
    "Used": 2,
    "New": 3,
    "Pre-registered": 4
  }
}